---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PathOfTravelCalculationService
source: html/43e46774-f3c0-5be9-1b4e-4814a5699504.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PathOfTravelCalculationService Property

Autodesk Internal: The service for path of travel calculations

## Syntax (C#)
```csharp
public static ExternalServiceId PathOfTravelCalculationService { get; }
```